app/views/orders/index.html.erb


              <td class="border border-slate-300 dark:border-slate-700 p-4 text-slate-500 dark:text-slate-400"><%= order.order_code %></td>
---
SELECT "orders".* FROM "orders"