app/controllers/customers_controller.rb

INSERT INTO "customers" ("code", "name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save