app/controllers/employees_controller.rb

INSERT INTO "employees" ("code", "name", "address", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save