app/controllers/orders_controller.rb

INSERT INTO "orders" ("order_code", "bill_no", "product_name", "quantity", "price", "discount", "date", "customer_code", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save