app/controllers/payments_controller.rb

INSERT INTO "payments" ("bill_no", "amount", "pay_type", "date", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @payment = Payment.new(payment_params)

    respond_to do |format|
      if @payment.save

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_payment
      @payment = Payment.find(params[:id])