app/controllers/products_controller.rb

INSERT INTO "products" ("code", "product_name", "describle", "price", "discount", "supplier_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save