app/controllers/suppliers_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)

    respond_to do |format|
      if @supplier.save
---
INSERT INTO "suppliers" ("sup_code", "supplier_name", "product_name", "address", "email", "pay_method", "discount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @supplier.update(supplier_params)
---
UPDATE "suppliers" SET "sup_code" = ?, "updated_at" = ? WHERE "suppliers"."id" = ?  [["sup_code", "S01"], ["updated_at", "2023-05-21 08:21:36.497555"], ["id", 2]]

    def set_supplier
      @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]